auto plantuml
