--- a/README.md
+++ b/README.md
@@ -16,13 +20,16 @@ I made a detailed description in <https://github.com/bestia-dev/win10_wsl2_debia
 For Rust development for Linux I have the container `rust_dev_vscode_cnt` created from the image `rust_dev_vscode_img` that I described here <https://github.com/bestia-dev/docker_rust_development>.  
 This container is ephemeral and can be destroyed any time. The important files inside it must be pushed to Github, else they will be destroyed with the container.  
 
-```mermaid
-sequenceDiagram
-    participant Github
-    participant container    
-    Github->>container: clone, pull
-    container->>Github: push    
+[comment]: # (auto_plantuml start)
+
+```plantuml
+@startuml
+Github -> container: clone, pull
+container--> Github: push
+@enduml
 ```
+
+[comment]: # (auto_plantuml end)
 
